using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _250402_Algorithm
{
    /**********************************************************************************
         * 알고리즘 (Algorithm)
         * 
         * 문제를 해결하기 위해 정해진 진행절차나 방법
         * 컴퓨터에서 알고리즘은 어떠한 행동을 하기 위해서 만들어진 프로그램명령어의 집합
         **********************************************************************************/

    // <알고리즘 조건>
    // 1. 입력 : 알고리즘은 0개 이상의 입력을 가져야 함
    // 2. 출력 : 알고리즘은 최소 1개 이상의 결과를 가져야 함
    // 3. 명확성 : 수행 과정은 모호하지 않고 정확한 수단을 제공해야 함
    // 4. 유한성 : 수행 과정은 무한하지 않고 유한한 작업 이후에 정지해야 함
    // 5. 효과성 : 모든 과정은 명백하게 실행 가능해야 함
    class Program
    {
        static void Main(string[] args)
        {
            
        }
    }
}
